<template>
  <ve-line :data="chartData">
     <H2>疫情趋势</H2>
  </ve-line>
</template>

<script>
  export default {
    data: function () {
      return {
        chartData: {
          columns: ['日期', '确诊数量', '疑似数量', '死亡率'],
          rows: [
            { '日期': '1/1', '确诊数量': 1393, '疑似数量': 1093, '死亡率': 0.32 },
            { '日期': '1/2', '确诊数量': 3530, '疑似数量': 3230, '死亡率': 0.26 },
            { '日期': '1/3', '确诊数量': 2923, '疑似数量': 2623, '死亡率': 0.76 },
            { '日期': '1/4', '确诊数量': 1723, '疑似数量': 1423, '死亡率': 0.49 },
            { '日期': '1/5', '确诊数量': 3792, '疑似数量': 3492, '死亡率': 0.323 },
            { '日期': '1/6', '确诊数量': 4593, '疑似数量': 4293, '死亡率': 0.78 }
          ]
        }
      }
    }
  }
</script>